function quadraticEquCalc(){
    var num1 = document.getElementById("num1").value,
        a = parseFloat(num1),
        num2 = document.getElementById("num2").value,
        b = parseFloat(num2),
        num3 = document.getElementById("num3").value,
        c = parseFloat(num3),
        start = document.getElementById("start"),
        determinant = document.getElementById("determinant"),
        result = document.getElementById("result"),
        x1,
        x2,
        D,
        sqrtD;

    if (isNaN(a) || isNaN(b) || isNaN(c)) {
        result.innerHTML = ("<strong class='text-danger'>'a','b' и 'c' трябва да са числа !</strong>");
    }
    else {
        if(a != 0) {
            D = (b * b - 4 * a * c);
            sqrtD = Math.sqrt(D);
//D > 0
            if(D > 0) {
                x2 = ((-b - Math.sqrt(D))/2*a),
                x1 = ((-b + Math.sqrt(D))/2* a);

                if(b < 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=(" + (-1)*b + "+" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x1+1)*100)/100)-1).toFixed(2) + "</br>" +
                        "x2=(" + (-1)*b + "-" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x2+1)*100)/100)-1).toFixed(2));
                }

                if(b > 0 && c > 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²+" + b + "x+" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=(" + (-1)*b + "+" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x1+1)*100)/100)-1).toFixed(2) + "</br>" +
                        "x2=(" + (-1)*b + "-" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x2+1)*100)/100)-1).toFixed(2));
                }

                if(b < 0 && c > 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x+" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=(" + (-1)*b + "+" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x1+1)*100)/100)-1).toFixed(2) + "</br>" +
                        "x2=(" + (-1)*b + "-" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x2+1)*100)/100)-1).toFixed(2));
                }
                if(b > 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²+" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=(" + (-1)*b + "+" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x1+1)*100)/100)-1).toFixed(2) + "</br>" +
                        "x2=(" + (-1)*b + "-" + ((Math.round((sqrtD+1)*100)/100)-1).toFixed(2) + ")/2*" + a + "=" + ((Math.round((x2+1)*100)/100)-1).toFixed(2));
                }
            }
//D < 0
            if(D < 0) {
                if(b < 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "<strong class='text-danger'>Дискриминантата е отрицателна и уравнението няма реални корени</strong>");
                }

                if(b < 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "<strong class='text-danger'>Дискриминантата е отрицателна и уравнението няма реални корени</strong>");
                }

                if(b > 0 && c > 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²+" + b + "x+" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "<strong class='text-danger'>Дискриминантата е отрицателна и уравнението няма реални корени</strong>");
                }

                if(b < 0 && c > 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x+" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "<strong class='text-danger'>Дискриминантата е отрицателна и уравнението няма реални корени</strong>");
                }

                if(b > 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²+" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "<strong class='text-danger'>Дискриминантата е отрицателна и уравнението няма реални корени</strong>");
                }
            }
//D === 0
            if(D === 0) {
                x = ((-b)/2* a);

                if(b < 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=x2=(" + (-1)*b + ")/2*" + a + "=" + ((Math.round((x+1)*100)/100)-1).toFixed(2));
                }

                if(b > 0 && c > 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²+" + b + "x+" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=x2=(" + (-1)*b + ")/2*" + a + "=" + ((Math.round((x+1)*100)/100)-1).toFixed(2));
                }

                if(b < 0 && c > 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²" + b + "x+" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=x2=(" + (-1)*b + ")/2*" + a + "=" + ((Math.round((x+1)*100)/100)-1).toFixed(2));
                }
                if(b > 0 && c < 0) {
                    result.innerHTML = (
                        "Замествам във формулата за основен вид на квадратно уравнение въведените стойности и получаваме: </br>" +
                        a + "x²+" + b + "x" + c + "=0 </br>" +
                        "След това пресмятаме дискриминантата по формулата D=b²-4*a*b → </br>" +
                        "D=" + b * b + "-4*(" + a + ")*(" + c + ")=" + D + "</br>" +
                        "След това пресмятаме корените на уравнението по формулата x1,2=(-b±V ̅D̅)/2*a → </br>" +
                        "x1=x2=(" + (-1)*b + ")/2*" + a + "=" + ((Math.round((x+1)*100)/100)-1).toFixed(2));
                }
            }
        }
        else {
            var x = (c / b)*(-1) ;
            result.innerHTML = (
                "Тъй като а е нула (a=0) получаваме линейно уравнение." +
                "Затова замествам във формулата за основен вид на линейно уравнение въведените стойности. </br>" +
                "От тук получаваме: " + b + "x+(" + c + ")=0. </br>" +
                "След това изразяваме x → </br>" + "x= " + (-c) + "/" + b + "=" + x);
        }
    }
}